from datetime import datetime

# Пример списка pers_id (замени на свои значения)
pers_ids = [
"600322302766",
"580319450501",
"940404400147",
"640607450411",
"690222302431",
"830223303703",
"880220301968",
"920210351117",
"970830350496",
"620630301627",
"920922350645",
"870318300336",
"810305350221",
"580519450370",
"900906301943",
"821220402429",
"900921302478",
"590514300927",
"060329500548",
"990601300745",
"581204300566",
"730715400312",
"550103302476",
"060330502292"
]


# Дата в нужном формате
created_at = updated_at = '2025-06-19'
source = 'external'
reason = 'Умершие'
  # Пример списка ID

# Генерация одного запроса с множественными VALUES
values = ",\n".join(
    [f"('{source}', '{reason}', '{created_at}', '{updated_at}', '{pers_id}')" for pers_id in pers_ids]
)

sql = f"INSERT INTO black_list (source, reason, created_at, updated_at, pers_id_c)\nVALUES\n{values};"

print(sql)


